application/app/controllers/activations_controller.rb

  def create
    @activation = Activation.custom_new(current_user, parse_form)

    if !@activation.errors.any? and @activation.save
---
INSERT INTO `activations` (`bucket`, `data`, `created_at`, `comments`, `method`, `updated_at`, `user_id`) VALUES(1, '--- \n- |\n DFSD343DSDSDJ4RJ3JH23J4HJ23HJ42N3JNJDNJRNDJN4ND4J3J534N5J34J5N34J53N4DNNDJNNJJ3DNJ3\n\n- |\n DFSD343DSDSDJ4RJ3JH23J4HJ23HJ42N3JNJDNJRNDJN4ND4J3J534N5J34J5N34J53N4DNNDJNNJJ3DNJ3\n\n', '2010-04-20 18:43:14', 'test', 'Leases', '2010-04-20 18:43:14', 2)
UPDATE `users` SET `updated_at` = '2010-04-20 21:00:29', `bucket` = 19 WHERE `id` = 2

  def destroy
    activation = accessible_activations.find_by_id(params[:id])

    if activation
      activation.destroy
---
DELETE FROM `activations` WHERE `id` = 3