application/app/controllers/sessions_controller.rb

  def create
    name = params[:name]
    password = params[:password]

    session[:lang] = params[:language]
    session[:user_id] = User.find_by_name_and_password(name, password)
---
SELECT * FROM `users` WHERE (`users`.`name` = 'root' AND `users`.`password` = '12345') LIMIT 1