application/app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def index
    @users = User.find(:all, :conditions => ["admin = ?", false])

INSERT INTO `users` (`name`, `created_at`, `updated_at`, `admin`, `activations`, `password`, `email`) VALUES('tch', '2010-04-20 14:48:43', '2010-04-20 14:48:43', 0, 100, '123', 'tch@paraguayeduca.org')
---
  def create
    user = User.new(parse_form())

    if user.save

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-04-19 21:31:02', `name` = 'sdsd123', `password` = 'dfsdf231' WHERE `id` = 7
---
  def update
    user = User.find(params[:id])

    if user.update_attributes(parse_form())

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    user = User.find(params[:id])
    user.destroy

UPDATE `users` SET `updated_at` = '2010-04-19 19:35:47', `password` = '123' WHERE `id` = 1
---
  def save_changed_password
    user =  current_user
    old_password = params[:old_password]
    new_password = params[:new_password]
    new_password_validation = params[:new_password_validation]

    if user.password == old_password and new_password == new_password_validation
      user.update_attributes({ :password => new_password })