Repository: tchx84/yaas-web
Catalog: translation/locale/*/yaas-web.po
Languages: es

source: %s belongs to the blacklist
es: %s se encuentra en la lista negra

source: %s's Options
es: Opciones para %s

source: Activation
es: Activación

source: Activation Limit (days)
es: Límite de Activaciones (días)

source: Activation Limit (days):
es: Límite de Activación (días):

source: Activation Method:
es: Método de Activación:

source: Activation backend reported a problem: %s
es: El servidor de activación reportó un problema: %s

source: Activation has been created.
es: La Activación ha sido creada.

source: Activation was successfully deleted.
es: La Activación fue eliminada exitosamente.

source: Activation's backend reported a problem
es: El servidor de activación reportó un problema

source: Activations
es: Activaciones

source: Back
es: Atrás

source: Blacklist
es: Lista negra

source: Blacklisted laptop was successfully created.
es: El serial ha ingresado a la lista negra.

source: Blacklisted laptop was successfully deleted.
es: El serial fue removido de la lista negra.

source: Blacklisted laptop was successfully updated.
es: La información ha sido actualizada.

source: Blacklisted laptops
es: Lista negra

source: Bucket
es: Cuota

source: Bucket:
es: Cuota

source: CJson format
es: Formato CJson

source: Can Create Dev keys
es: Puede crear llaves de desarrollador

source: Can create developer keys:
es: Puede crear llaves de desarrollador

source: Change password
es: Cambiar Contraseña

source: Change you current password
es: Cambia tu contraseña actual

source: Comments
es: Comentarios

source: Comments:
es: Comentarios:

source: Create
es: Crear

source: Create Activation
es: Crear Activación

source: Create Blacklisted laptop
es: Agregar a la lista

source: Create User
es: Crear Usuario

source: Create activation
es: Crear Activación

source: Create blacklisted laptop
es: Agregar a la lista

source: Create user
es: Crear Usuario

source: Created
es: Creado

source: Created at
es: Creado el

source: Delete
es: Borrar

source: Destroy
es: Destruir

source: Download
es: Descargar

source: Download the activations you have created
es: Descarga las activaciones que has creado

source: Duration must be within 1 and %d days
es: La duración debe estar entre 1 y %d días

source: Edit
es: Editar

source: Edit Blacklisted laptop
es: Editar

source: Edit User
es: Editar Usuario

source: Email
es: Correo Electrónico

source: Email:
es: Correo Electrónico:

source: English
es: Inglés

source: Invalid password
es: Contraseña incorrecta

source: Language
es: Idioma

source: Laptops data:
es: Información de Laptops:

source: Lease duration (days):
es: Duración de Concesión (días):

source: List activations
es: Lista de Activaciones

source: List of all blacklisted laptops of the system
es: Seriales incluidos en la lista negra

source: List of all users of the system
es: Lista de todos los Usuarios del Sistema

source: List users
es: Lista de Usuarios

source: Login
es: Ingresar

source: Logout
es: Cerrar Sesión

source: Method
es: Método

source: Modify blacklisted laptop's information
es: Modificar

source: Modify user's information
es: Modificar información de usuario

source: Name
es: Nombre

source: New Session
es: Nueva Sesión

source: New password validation:
es: Validación de nueva contraseña:

source: New password:
es: Contraseña Nueva:

source: Old password:
es: Contraseña anterior:

source: Password
es: Contraseña

source: Password changed
es: Contraseña cambiada

source: Password:
es: Contraseña:

source: Please complete all needed information
es: Por favor complete toda la información de usuario

source: Please complete all user's information
es: Por favor complete toda la información de usuario

source: Please enter your login information
es: Por favor introduzca su información de usuario

source: Reason
es: Motivo

source: Reason:
es: Motivo:

source: Save
es: Guardar

source: Serial Number
es: Número de Serial

source: Serial Number:
es: Número de Serial:

source: Session terminated
es: Sesión Finalizada

source: Spanish
es: Español

source: System administration options
es: Opciones del Sistema Administrativo

source: The data file you provided has no valid elements
es: El archivo de datos que ha proveido contiene elementos que no son validos

source: There is no such activation.
es: No hay tal activación.

source: There is not such activation.
es: No hay tal activación.

source: Use your data files to create activations
es: Usa tu archivo de datos para crear las activaciones

source: User was successfully created.
es: El Usuario fue creado exitosamente.

source: User was successfully deleted.
es: El Usuario fue eliminado exitosamente.

source: User was successfully updated.
es: El Usuario fue actualizado exitosamente.

source: User's name or password incorrect
es: Nombre de Usuario o Contraseña Incorrecta

source: Username:
es: Nombre de Usuario:

source: Users
es: Usuarios

source: Verification doesn't match
es: No se cumplió la verificación

source: Yes
es: Sí

source: You are not authorized to generate developer keys
es: No estás autorizado a generar llaves de desarrollador

source: You currently have %d activations available in your bucket
es: Tienes %d activaciones disponibles en tu cuota

source: You need to provide a data file
es: Necesitas proporcionar un archivo de datos

source: Your activation's bucket is not enough
es: Su cuota de activación es insuficiente
